IOsonata/IOsonata/ARM/Nordic/nRF52/src/usbd_ctrlr_nrf52.cpp
static void nRFUsbdDmaWait(void)
{
	for (;;)
	{
		const uint8_t epAddr = (uint8_t)atomic_load(&s_DmaEpAddr);
		if (epAddr == NRFX_USBD_DMA_EP_NONE)
		{
			return;
		}

		if (NRF_USBD->EVENTS_USBRESET != 0U)
		{
			nRFUsbdDmaRelease();
			return;
		}

		volatile uint32_t *pEvent = nRFUsbdDmaEndEvent(epAddr);
		if (*pEvent == 0U)
		{
			continue;
		}

		*pEvent = 0;
		__ISB();
		__DSB();
		nRFUsbdDmaRelease();
	}
}

static void nRFUsbdNoDmaTask(volatile uint32_t *pTask)
{
	*pTask = 1;
	__ISB();
	__DSB();
	atomic_flag_clear(&s_DmaRunning);
}

static void nRFUsbdEp0StatusNow(void)
{
	const uint8_t epAddr = s_Ctrlr.SetupDirIn ?
		USB_ENDPADDR_DIR_OUT : USB_ENDPADDR_DIR_IN;
	nRFUsbdXfer_t *pXfer = nRFUsbdGetXfer(epAddr);

	NRF_USBD->TASKS_EP0STATUS = 1;
	__ISB();
	__DSB();

	if (pXfer->Started && pXfer->TotalLen == 0U)
	{
		pXfer->Started = false;
		nRFUsbdEmitXfer(epAddr, 0, USBD_CTRLR_XFER_SUCCESS);
	}

	atomic_flag_clear(&s_DmaRunning);
}

static bool nRFUsbdStartOutDmaNow(uint8_t EpNum)
{
	nRFUsbdXfer_t *pXfer = &s_Ctrlr.Xfer[EpNum][0];

	if (!pXfer->Started || pXfer->ActualLen > pXfer->TotalLen)
	{
		return false;
	}

	const uint16_t Remaining =
		(uint16_t)(pXfer->TotalLen - pXfer->ActualLen);
	const uint16_t Received = (uint16_t)NRF_USBD->SIZE.EPOUT[EpNum];
	const uint16_t TransferLen = Received < Remaining ? Received : Remaining;

	NRF_USBD->EPOUT[EpNum].PTR = (uint32_t)(uintptr_t)pXfer->pBuffer;
	NRF_USBD->EPOUT[EpNum].MAXCNT = TransferLen;
	nRFUsbdDmaStart(&NRF_USBD->TASKS_STARTEPOUT[EpNum], EpNum);

	return true;
}

static bool nRFUsbdStartInDmaNow(uint8_t EpNum)
{
	nRFUsbdXfer_t *pXfer = &s_Ctrlr.Xfer[EpNum][1];

	if (!pXfer->Started || pXfer->ActualLen > pXfer->TotalLen)
	{
		return false;
	}

	const uint16_t Remaining =
		(uint16_t)(pXfer->TotalLen - pXfer->ActualLen);
	const uint16_t TransferLen = Remaining < pXfer->Mps ? Remaining : pXfer->Mps;

	NRF_USBD->EPIN[EpNum].PTR = (uint32_t)(uintptr_t)pXfer->pBuffer;
	NRF_USBD->EPIN[EpNum].MAXCNT = TransferLen;
	nRFUsbdDmaStart(&NRF_USBD->TASKS_STARTEPIN[EpNum],
					 (uint8_t)(EpNum | USB_ENDPADDR_DIR_IN));

	return true;
}

static void nRFUsbdServicePending(void)
{
	if (atomic_load(&s_HostResumePending) ||
		(atomic_load(&s_BusSuspended) && !atomic_load(&s_SuspendPending)))
	{
		return;
	}

	for (;;)
	{
		if (atomic_flag_test_and_set(&s_DmaRunning))
		{
			return;
		}

		if (atomic_exchange(&s_PendingEp0Status, false))
		{
			nRFUsbdEp0StatusNow();
			continue;
		}

		if (atomic_exchange(&s_PendingEp0RcvOut, false))
		{
			nRFUsbdNoDmaTask(&NRF_USBD->TASKS_EP0RCVOUT);
			continue;
		}

		uint16_t pending = (uint16_t)atomic_load(&s_PendingOut);
		uint8_t epNum = nRFUsbdFirstPending(pending);
		if (epNum < NRFX_USBD_EP_COUNT)
		{
			atomic_fetch_and(&s_PendingOut, (uint_fast16_t)~(1U << epNum));
			if (nRFUsbdStartOutDmaNow(epNum))
			{
				return;
			}
			atomic_flag_clear(&s_DmaRunning);
			continue;
		}

		pending = (uint16_t)atomic_load(&s_PendingIn);
		epNum = nRFUsbdFirstPending(pending);
		if (epNum < NRFX_USBD_EP_COUNT)
		{
			atomic_fetch_and(&s_PendingIn, (uint_fast16_t)~(1U << epNum));
			if (nRFUsbdStartInDmaNow(epNum))
			{
				return;
			}
			atomic_flag_clear(&s_DmaRunning);
			continue;
		}

		atomic_flag_clear(&s_DmaRunning);
		return;
	}
}

static void nRFUsbdQueueOut(uint8_t EpNum)
{
	atomic_fetch_or(&s_PendingOut, (uint_fast16_t)(1U << EpNum));
	nRFUsbdServicePending();
}

static void nRFUsbdQueueIn(uint8_t EpNum)
{
	atomic_fetch_or(&s_PendingIn, (uint_fast16_t)(1U << EpNum));
	nRFUsbdServicePending();
}

static void nRFUsbdQueueEp0Status(void)
{
	atomic_store(&s_PendingEp0Status, true);
	nRFUsbdServicePending();
}

static void nRFUsbdQueueEp0RcvOut(void)
{
	atomic_store(&s_PendingEp0RcvOut, true);
	nRFUsbdServicePending();
}

static void nRFUsbdResetState(void)
{
	memset(s_Ctrlr.Xfer, 0, sizeof(s_Ctrlr.Xfer));
	s_Ctrlr.Xfer[0][0].Mps = NRFX_USBD_MAX_PACKET_SIZE;
	s_Ctrlr.Xfer[0][1].Mps = NRFX_USBD_MAX_PACKET_SIZE;
	s_Ctrlr.SofEnabled = false;
	s_Ctrlr.SetupDirIn = false;

	atomic_store(&s_PendingOut, 0);
	atomic_store(&s_PendingIn, 0);
	atomic_store(&s_PendingEp0Status, false);
	atomic_store(&s_PendingEp0RcvOut, false);
	atomic_store(&s_BusSuspended, false);
	atomic_store(&s_SuspendPending, false);
	atomic_store(&s_RemoteWakePending, false);
	atomic_store(&s_HostResumePending, false);
	atomic_store(&s_MacAwake, true);
	atomic_store(&s_DmaEpAddr, NRFX_USBD_DMA_EP_NONE);
	atomic_flag_clear(&s_DmaRunning);

	if (nrf52_errata_199())
	{
		NRFX_USBD_ERRATA_199_REG = 0x00000000UL;
	}
}

static void nRFUsbdAbortEp0(void)
{
	const uint8_t dmaEpAddr = (uint8_t)atomic_load(&s_DmaEpAddr);
	if (dmaEpAddr != NRFX_USBD_DMA_EP_NONE && USB_ENDPADDR_NUM(dmaEpAddr) == 0U)
	{
		nRFUsbdDmaWait();
	}

	atomic_fetch_and(&s_PendingOut, (uint_fast16_t)~1U);
	atomic_fetch_and(&s_PendingIn, (uint_fast16_t)~1U);
	atomic_store(&s_PendingEp0Status, false);
	atomic_store(&s_PendingEp0RcvOut, false);

	for (uint8_t dir = 0; dir < 2U; dir++)
	{
		nRFUsbdXfer_t *pXfer = &s_Ctrlr.Xfer[0][dir];
		pXfer->pBuffer = NULL;
		pXfer->TotalLen = 0;
		pXfer->ActualLen = 0;
		pXfer->Mps = NRFX_USBD_MAX_PACKET_SIZE;
		pXfer->DataReceived = false;
		pXfer->Started = false;
	}

	NRF_USBD->EVENTS_ENDEPIN[0] = 0;
	NRF_USBD->EVENTS_ENDEPOUT[0] = 0;
	NRF_USBD->EPDATASTATUS = (1UL << 0) | (1UL << 16);
	__ISB();
	__DSB();
}

static void nRFUsbdHostResumeDetected(void);

static void nRFUsbdTryEnterLowPower(void)
{
	if (!atomic_load(&s_BusSuspended) ||
		!atomic_load(&s_SuspendPending) ||
		atomic_load(&s_RemoteWakePending) ||
		atomic_load(&s_HostResumePending) ||
		(uint8_t)atomic_load(&s_DmaEpAddr) != NRFX_USBD_DMA_EP_NONE ||
		atomic_load(&s_PendingOut) != 0U ||
		atomic_load(&s_PendingIn) != 0U ||
		atomic_load(&s_PendingEp0Status) ||
		atomic_load(&s_PendingEp0RcvOut))
	{
		return;
	}

	if ((NRF_USBD->EVENTCAUSE & USBD_EVENTCAUSE_RESUME_Msk) != 0U ||
		NRF_USBD->EVENTS_SOF != 0U)
	{
		nRFUsbdHostResumeDetected();
		return;
	}

	if (atomic_flag_test_and_set(&s_DmaRunning))
	{
		return;
	}

	if (!atomic_load(&s_BusSuspended) ||
		!atomic_load(&s_SuspendPending) ||
		atomic_load(&s_RemoteWakePending) ||
		atomic_load(&s_HostResumePending) ||
		(uint8_t)atomic_load(&s_DmaEpAddr) != NRFX_USBD_DMA_EP_NONE ||
		atomic_load(&s_PendingOut) != 0U ||
		atomic_load(&s_PendingIn) != 0U ||
		atomic_load(&s_PendingEp0Status) ||
		atomic_load(&s_PendingEp0RcvOut))
	{
		atomic_flag_clear(&s_DmaRunning);
		return;
	}

	if ((NRF_USBD->EVENTCAUSE & USBD_EVENTCAUSE_RESUME_Msk) != 0U ||
		NRF_USBD->EVENTS_SOF != 0U)
	{
		atomic_flag_clear(&s_DmaRunning);
		nRFUsbdHostResumeDetected();
		return;
	}

	atomic_store(&s_MacAwake, false);
	NRF_USBD->LOWPOWER =
		USBD_LOWPOWER_LOWPOWER_LowPower << USBD_LOWPOWER_LOWPOWER_Pos;
	(void)NRF_USBD->LOWPOWER;
	__ISB();
	__DSB();

	if ((NRF_USBD->EVENTCAUSE & USBD_EVENTCAUSE_RESUME_Msk) != 0U ||
		NRF_USBD->EVENTS_SOF != 0U)
	{
		atomic_flag_clear(&s_DmaRunning);
		nRFUsbdHostResumeDetected();
		return;
	}

