IOsonata/IOsonata/ARM/Nordic/nRF52/src/usbd_ctrlr_nrf52.cpp
	const bool controlStatus =
		epNum == 0 && TotalBytes == 0 &&
		USB_ENDPADDR_IS_IN(EpAddr) != s_Ctrlr.SetupDirIn;

	if (controlStatus)
	{
		nRFUsbdQueueEp0Status();
	}
	else if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		nRFUsbdQueueIn(epNum);
	}
	else if (epNum == 0)
	{
		nRFUsbdQueueEp0RcvOut();
	}
	else if (pXfer->DataReceived)
	{
		pXfer->DataReceived = false;
		nRFUsbdQueueOut(epNum);
	}

	return true;
}

bool UsbdCtrlrEpBusy(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	return epNum < NRFX_USBD_EP_COUNT && nRFUsbdGetXfer(EpAddr)->Started;
}

void UsbdCtrlrEpStall(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (epNum >= NRFX_USBD_EP_COUNT)
	{
		return;
	}

	if (epNum == 0)
	{
		NRF_USBD->TASKS_EP0STALL = 1;
	}
	else
	{
		NRF_USBD->EPSTALL =
			(USBD_EPSTALL_STALL_Stall << USBD_EPSTALL_STALL_Pos) | EpAddr;
	}
	__ISB();
	__DSB();
}

void UsbdCtrlrEpClearStall(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (epNum == 0 || epNum >= NRFX_USBD_EP_COUNT)
	{
		return;
	}

	NRF_USBD->DTOGGLE = EpAddr;
	NRF_USBD->DTOGGLE =
		(USBD_DTOGGLE_VALUE_Data0 << USBD_DTOGGLE_VALUE_Pos) | EpAddr;
	NRF_USBD->EPSTALL =
		(USBD_EPSTALL_STALL_UnStall << USBD_EPSTALL_STALL_Pos) | EpAddr;

	if (!USB_ENDPADDR_IS_IN(EpAddr))
	{
		NRF_USBD->SIZE.EPOUT[epNum] = 0;
	}
	__ISB();
	__DSB();
}

static uint32_t nRFUsbdCollectEvents(void)
{
	const uint32_t inten = NRF_USBD->INTEN;
	uint32_t intStatus = 0;
	volatile uint32_t *pEvent = &NRF_USBD->EVENTS_USBRESET;

	for (uint8_t index = 0; index < NRFX_USBD_IRQ_EVENT_COUNT; index++)
	{
		const uint32_t mask = (1UL << index);
		if ((inten & mask) == 0 || pEvent[index] == 0)
		{
			continue;
		}
		intStatus |= mask;
		pEvent[index] = 0;
		__ISB();
		__DSB();
	}
	return intStatus;
}

static void nRFUsbdBusReset(void)
{
	if ((uint8_t)atomic_load(&s_DmaEpAddr) != NRFX_USBD_DMA_EP_NONE)
	{
		nRFUsbdDmaRelease();
	}

	NRF_USBD->EPOUTEN = 1UL;
	NRF_USBD->EPINEN = 1UL;

	for (uint8_t epNum = 0; epNum < NRFX_USBD_EP_COUNT; epNum++)
	{
		NRF_USBD->TASKS_STARTEPIN[epNum] = 0;
		NRF_USBD->TASKS_STARTEPOUT[epNum] = 0;
	}

	const uint32_t dataStatus = NRF_USBD->EPDATASTATUS;
	NRF_USBD->EPDATASTATUS = dataStatus;

	NRF_USBD->EVENTS_USBEVENT = 0;
	const uint32_t cause = NRF_USBD->EVENTCAUSE;
	NRF_USBD->EVENTCAUSE = cause;

	NRF_USBD->INTENCLR = NRF_USBD->INTEN;
	NRF_USBD->INTENSET =
		USBD_INTEN_USBRESET_Msk |
		USBD_INTEN_USBEVENT_Msk |
		USBD_INTEN_EPDATA_Msk |
		USBD_INTEN_EP0SETUP_Msk |
		USBD_INTEN_EP0DATADONE_Msk |
		USBD_INTEN_ENDEPIN0_Msk |
		USBD_INTEN_ENDEPOUT0_Msk;

	nRFUsbdResetState();
}

static void nRFUsbdSetupEvent(void)
{
	UsbdCtrlrEvt_t evt = {};
	evt.Type = USBD_CTRLR_EVT_SETUP;
	evt.Setup.bmRequestType = (uint8_t)NRF_USBD->BMREQUESTTYPE;
	evt.Setup.bRequest = (uint8_t)NRF_USBD->BREQUEST;
	evt.Setup.wValue = (uint16_t)NRF_USBD->WVALUEL |
		((uint16_t)NRF_USBD->WVALUEH << 8);
	evt.Setup.wIndex = (uint16_t)NRF_USBD->WINDEXL |
		((uint16_t)NRF_USBD->WINDEXH << 8);
	evt.Setup.wLength = (uint16_t)NRF_USBD->WLENGTHL |
		((uint16_t)NRF_USBD->WLENGTHH << 8);

	s_Ctrlr.SetupDirIn =
		(evt.Setup.bmRequestType & USB_REQTYPE_MASK_DIR) != 0;

	const bool setAddress =
		(evt.Setup.bmRequestType &
		 (USB_REQTYPE_MASK_RECEIPT | USB_REQTYPE_MASK_TYPE)) == 0 &&
		evt.Setup.bRequest == USB_REQ_SET_ADDRESS;

	if (setAddress)
	{
		UsbdCtrlrEvt_t addrEvt = {};
		addrEvt.Type = USBD_CTRLR_EVT_ADDRESS;
		addrEvt.Address = (uint8_t)(evt.Setup.wValue & 0x7FU);
		nRFUsbdEmit(&addrEvt);
		return;
	}

	nRFUsbdEmit(&evt);
}

static void nRFUsbdHandleOutEnd(uint8_t EpNum)
{
	nRFUsbdXfer_t *pXfer = &s_Ctrlr.Xfer[EpNum][0];
	if (!pXfer->Started)
	{
		return;
	}

	const uint16_t transferLen = (uint16_t)NRF_USBD->EPOUT[EpNum].AMOUNT;
	if (pXfer->pBuffer != NULL)
	{
		pXfer->pBuffer += transferLen;
	}
	pXfer->ActualLen += transferLen;

	if (transferLen == pXfer->Mps && pXfer->ActualLen < pXfer->TotalLen)
	{
		if (EpNum == 0)
		{
			nRFUsbdQueueEp0RcvOut();
		}
	}
	else
	{
		pXfer->Started = false;
		nRFUsbdEmitXfer(EpNum, pXfer->ActualLen, USBD_CTRLR_XFER_SUCCESS);
	}
}

static void nRFUsbdHandleOutData(uint8_t EpNum)
{
	nRFUsbdXfer_t *pXfer = &s_Ctrlr.Xfer[EpNum][0];
	if (pXfer->Started &&
		(pXfer->ActualLen < pXfer->TotalLen || pXfer->TotalLen == 0))
	{
		pXfer->DataReceived = false;
		nRFUsbdQueueOut(EpNum);
	}
	else
	{
		pXfer->DataReceived = true;
	}
}

static void nRFUsbdHandleInData(uint8_t EpNum)
{
	nRFUsbdXfer_t *pXfer = &s_Ctrlr.Xfer[EpNum][1];
	if (!pXfer->Started)
	{
		return;
	}

	const uint16_t transferLen = (uint16_t)NRF_USBD->EPIN[EpNum].AMOUNT;
	if (pXfer->pBuffer != NULL)
	{
		pXfer->pBuffer += transferLen;
	}
	pXfer->ActualLen += transferLen;

	if (pXfer->ActualLen < pXfer->TotalLen)
	{
		nRFUsbdQueueIn(EpNum);
	}
	else
	{
		pXfer->Started = false;
		nRFUsbdEmitXfer((uint8_t)(EpNum | USB_ENDPADDR_DIR_IN),
						 pXfer->ActualLen, USBD_CTRLR_XFER_SUCCESS);
	}
}

static void nRFUsbdIrqHandler(void)
{
	const uint32_t intStatus = nRFUsbdCollectEvents();
	if (intStatus == 0)
	{
		return;
	}

	uint32_t eventCause = 0;
	if ((intStatus & USBD_INTEN_USBEVENT_Msk) != 0)
	{
		eventCause = NRF_USBD->EVENTCAUSE;
		NRF_USBD->EVENTCAUSE = eventCause;
		__ISB();
		__DSB();
	}

	const uint8_t dmaEpAddr = (uint8_t)atomic_load(&s_DmaEpAddr);
	if (dmaEpAddr != NRFX_USBD_DMA_EP_NONE &&
		(intStatus & nRFUsbdDmaEndMask(dmaEpAddr)) != 0U)
	{
		nRFUsbdDmaRelease();
	}

	if ((intStatus & USBD_INTEN_USBRESET_Msk) != 0)
	{
		nRFUsbdBusReset();
		nRFUsbdEmitSimple(USBD_CTRLR_EVT_RESET);
		return;
	}

	if ((intStatus & USBD_INTEN_USBEVENT_Msk) != 0)
	{
		if ((eventCause & USBD_EVENTCAUSE_SUSPEND_Msk) != 0 &&
			!atomic_exchange(&s_BusSuspended, true))
		{
			atomic_store(&s_SuspendPending, true);
			atomic_store(&s_RemoteWakePending, false);
			atomic_store(&s_HostResumePending, false);
			if ((NRF_USBD->INTEN & USBD_INTEN_SOF_Msk) == 0U)
			{
				NRF_USBD->EVENTS_SOF = 0;
			}
			NRF_USBD->INTENSET = USBD_INTENSET_SOF_Msk;
			nRFUsbdEmitSimple(USBD_CTRLR_EVT_SUSPEND);
		}

		if ((eventCause & USBD_EVENTCAUSE_RESUME_Msk) != 0)
		{
			nRFUsbdHostResumeDetected();
		}

		if ((eventCause & USBD_EVENTCAUSE_USBWUALLOWED_Msk) != 0)
		{
			nRFUsbdWakeAllowed();
		}
	}

	for (uint8_t epNum = 1; epNum < NRFX_USBD_EP_COUNT; epNum++)
	{
		if ((intStatus & (1UL << (USBD_INTEN_ENDEPOUT0_Pos + epNum))) != 0)
		{
			nRFUsbdHandleOutEnd(epNum);
		}
	}

	uint32_t dataStatus = 0;
	if ((intStatus & (USBD_INTEN_EPDATA_Msk | USBD_INTEN_EP0DATADONE_Msk)) != 0)
	{
		dataStatus = NRF_USBD->EPDATASTATUS;
		NRF_USBD->EPDATASTATUS = dataStatus;
		__ISB();
		__DSB();

		for (uint8_t epNum = 1; epNum < NRFX_USBD_EP_COUNT; epNum++)
		{
			if ((dataStatus & (1UL << (16U + epNum))) != 0)
			{
				nRFUsbdHandleOutData(epNum);
			}
		}

		for (uint8_t epNum = 1; epNum < NRFX_USBD_EP_COUNT; epNum++)
		{
			if ((dataStatus & (1UL << epNum)) != 0)
			{
				nRFUsbdHandleInData(epNum);
			}
		}
	}

	const bool setupPending = (intStatus & USBD_INTEN_EP0SETUP_Msk) != 0;
	if (setupPending)
	{
		nRFUsbdHostResumeDetected();
		nRFUsbdAbortEp0();
		nRFUsbdSetupEvent();
	}
	else
	{
		if ((intStatus & USBD_INTEN_ENDEPOUT0_Msk) != 0)
		{
			nRFUsbdHandleOutEnd(0);
		}

		if ((intStatus & USBD_INTEN_EP0DATADONE_Msk) != 0)
		{
			if (s_Ctrlr.SetupDirIn)
			{
				nRFUsbdHandleInData(0);
			}
			else
			{
				nRFUsbdHandleOutData(0);
			}
		}
	}

	if ((intStatus & USBD_INTEN_SOF_Msk) != 0)
	{
		nRFUsbdHostResumeDetected();

		UsbdCtrlrEvt_t evt = {};
		evt.Type = USBD_CTRLR_EVT_SOF;
		evt.FrameNo = (uint16_t)NRF_USBD->FRAMECNTR;
		nRFUsbdEmit(&evt);

		if (!s_Ctrlr.SofEnabled)
		{
			NRF_USBD->INTENCLR = USBD_INTENCLR_SOF_Msk;
		}
	}

	nRFUsbdServicePending();
	nRFUsbdTryRemoteWake();
	nRFUsbdTryEnterLowPower();
}

extern "C" void USBD_IRQHandler(void)
{
	nRFUsbdIrqHandler();
}
